       IDENTIFICATION DIVISION.
       PROGRAM-ID. GAJI.
       AUTHOR RINI.
       INSTALLATION. JAYA STORE.
       DATE-WRITTEN. 17-09-2020.
       DATE-COMPILED. 17-09-2020.
       SECURITY. PRIVATE
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
           SOURCE-COMPUTER. LENOVO330.
           OBJECT-COMPUTER. LENOVO320.
       INPUT-OUTPUT SECTION.
           FILE-CONTROL.
           SELECT GajiKaryawan ASSIGN TO DISK.
       DATA DIVISION.
       FILE SECTION.
       FD Gajikaryawan.
       01 GAJI PIC 9(8).

       WORKING-STORAGE SECTION.
       01 GAJI-POKOK PIC 9(8).
       01 TUNJANGAN PIC 9(8).
       01 TOTAL PIC 9(8).
       PROCEDURE DIVISION.
       MULAI.
            DISPLAY 'MASUKKAN GAJI POKOK :'
            ACCEPT GAJI-POKOK.
            DISPLAY 'MASUKKAN TUNJANGAN  :'
            ACCEPT TUNJANGAN.
            COMPUTE TOTAL = GAJI-POKOK + TUNJANGAN.
            DISPLAY 'TOTAL PENDAPATAN    : ' TOTAL.
       SELESAI.
           STOP RUN.
