       IDENTIFICATION DIVISION.
       PROGRAM-ID. DATAMHS.
       AUTHOR. ANDI MOHAMMAD NABIL RAMADAN.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       INPUT-OUTPUT SECTION.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       01 NAMA PIC A(27) VALUE 'ANDI MOHAMMAD NABIL RAMADAN'.
       01 NPM PIC 9(8) VALUE 10119723.
       01 KELAS PIC X(5) VALUE '2KA09'.
       PROCEDURE DIVISION.
           MULAI.
              DISPLAY 'NAMA  : ' NAMA.
              DISPLAY 'NPM   : ' NPM.
              DISPLAY 'KELAS : ' KELAS.
           SELESAI.
       STOP RUN.
